# 判断一个 9x9 的数独是否有效。只需要根据以下规则，验证已经填入的数字是否有效即可。 
# 
#  
#  数字 1-9 在每一行只能出现一次。 
#  数字 1-9 在每一列只能出现一次。 
#  数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。 
#  
# 
#  
# 
#  上图是一个部分填充的有效的数独。 
# 
#  数独部分空格内已填入了数字，空白格用 '.' 表示。 
# 
#  示例 1: 
# 
#  输入:
# [
#   ["5","3",".",".","7",".",".",".","."],
#   ["6",".",".","1","9","5",".",".","."],
#   [".","9","8",".",".",".",".","6","."],
#   ["8",".",".",".","6",".",".",".","3"],
#   ["4",".",".","8",".","3",".",".","1"],
#   ["7",".",".",".","2",".",".",".","6"],
#   [".","6",".",".",".",".","2","8","."],
#   [".",".",".","4","1","9",".",".","5"],
#   [".",".",".",".","8",".",".","7","9"]
# ]
# 输出: true
#  
# 
#  示例 2: 
# 
#  输入:
# [
#   ["8","3",".",".","7",".",".",".","."],
#   ["6",".",".","1","9","5",".",".","."],
#   [".","9","8",".",".",".",".","6","."],
#   ["8",".",".",".","6",".",".",".","3"],
#   ["4",".",".","8",".","3",".",".","1"],
#   ["7",".",".",".","2",".",".",".","6"],
#   [".","6",".",".",".",".","2","8","."],
#   [".",".",".","4","1","9",".",".","5"],
#   [".",".",".",".","8",".",".","7","9"]
# ]
# 输出: false
# 解释: 除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。
#      但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。 
# 
#  说明: 
# 
#  
#  一个有效的数独（部分已被填充）不一定是可解的。 
#  只需要根据以上规则，验证已经填入的数字是否有效即可。 
#  给定数独序列只包含数字 1-9 和字符 '.' 。 
#  给定数独永远是 9x9 形式的。 
#  
#  Related Topics 哈希表 
#  👍 439 👎 0


# leetcode submit region begin(Prohibit modification and deletion)
class Solution:
    def isValidSudoku(self, board: List[List[str]]) -> bool:
        # 解法一: 迭代遍历所有格子
        # 重点: 从左到右从上到下划成9个3*3的方块(编号0~8)
        #       box_index = (row / 3) * 3 + columns / 3
        # row = [set() for _ in range(9)]
        # col = [set() for _ in range(9)]
        # box = [set() for _ in range(9)]

        row = [[0]*9 for _ in range(9)]
        col = [[0]*9 for _ in range(9)]
        box = [[0]*9 for _ in range(9)]

        for i in range(9):
            for j in range(9):
                if board[i][j] == '.': continue
                # if board[i][j] in row[i] or board[i][j] in col[j] or board[i][j] in box[(i//3) * 3 + j//3]:
                #     return False
                # row[i].add(board[i][j])
                # col[j].add(board[i][j])
                # box[(i//3) * 3 + j//3].add(board[i][j])

                '''用下面这种方式，减少了每次的搜索时间。(上面是O(9)复杂度)'''
                if row[i][int(board[i][j])-1] or col[j][int(board[i][j])-1] or box[(i//3) * 3 + j//3][int(board[i][j])-1]:
                    return False
                row[i][int(board[i][j]) - 1] = 1
                col[j][int(board[i][j]) - 1] = 1
                box[(i//3) * 3 + j//3][int(board[i][j]) - 1] = 1

        return True
# leetcode submit region end(Prohibit modification and deletion)
